perf/tests/api-test-base.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  payload:
    path: 'words.csv'
    fields:
      - 'word'
    loadAll: true

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5
    

scenarios:
  - name: Ping
    flow:
      - get:
          url: '/ping'
  - name: Dictionary
    flow:
      - get:
          url: '/dictionary'
          qs: 
            word: '{{ word }}'
  - name: Quote
    flow:
      - get:
          url: '/quote'
  - name: Spaceflight News
    flow:
      - get:
          url: '/spaceflight_news'