perf/tests/dictionary_load.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  payload:
    path: 'words.csv'
    fields:
      - 'word'
    loadAll: true 


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 300
      arrivalRate: 5

scenarios:
  - name: Dictionary Load
    flow:
      - get:
          url: '/dictionary'
          qs: 
            word: '{{ word }}'