perf/tests/dictionary_stress.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  payload:
    path: 'words.csv'
    fields:
      - 'word'
    loadAll: true 


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: RampUp
      duration: 60
      arrivalRate: 5
      rampTo: 100
    - name: Plain
      duration: 60
      arrivalRate: 100
    - name: Cleanup
      duration: 15
      arrivalRate: 0

scenarios:
  - name: Dictionary Stress
    flow:
      - get:
          url: '/dictionary'
          qs: 
            word: '{{ word }}'