perf/tests/ping_stress.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"    

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: RampUp
      duration: 60
      arrivalRate: 5
      rampTo: 600
    - name: Plain
      duration: 120
      arrivalRate: 600
    - name: Cleanup
      duration: 15
      arrivalRate: 0


scenarios:
  - name: Ping Stress
    flow:
      - get:
          url: '/ping'