perf/tests/quote_spike.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
    apiv2:
      target: 'http://localhost:5555/api/v2'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 40
      arrivalRate: 5
    - name: Spike
      duration: 10
      arrivalRate: 200
    - name: Return
      duration: 60
      arrivalRate: 5
    

scenarios:
  - name: Quote
    flow:
      - get:
          url: '/quote'